# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [123]:
%pip install psycopg2-binary pandas faker sqlalchemy scikit-learn

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: scikit-learn in ./.venv/lib/python3.13/site-packages (1.6.1)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: scipy>=1.6.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [124]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine
from sklearn.preprocessing import MinMaxScaler

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [125]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(100):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Nathaniel Wilson', 'ML Engineer', '2016-05-23', 85869);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Cline', 'Cloud Architect', '2016-06-06', 126058);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Sims', 'Frontend Developer', '2022-10-12', 71828);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Ronnie Jennings', 'DevOps Engineer', '2015-04-13', 86689);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Martinez', 'Frontend Developer', '2020-11-16', 163454);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alexis May', 'SysAdmin', '2022-08-11', 87731);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Keller', 'Data Analyst', '2020-11-17', 84536);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cristian Hoffman', 'DevOps Engineer', '2022-10-06', 130641);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amy Zimmerman', 'Frontend Developer', '2015-07-10', 101146);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Sims', 'SysAdmin', '2021-09-22', 89650);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ryan Evans', 'QA Engineer', '2023-02-12', 116378);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joshua Miller', 'DevOps Engineer', '2024-01-13', 134923);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Jackson', 'QA Engineer', '2017-09-09', 97430);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jonathan Hernandez', 'Data Scientist', '2021-02-12', 123434);
INSERT INTO employees (name, position, start_date, salary) VALUES('Crystal Ball', 'DevOps Engineer', '2016-07-07', 120173);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joanna Smith', 'QA Engineer', '2021-07-13', 156158);
INSERT INTO employees (name, position, start_date, salary) VALUES('Harold Montes', 'ML Engineer', '2023-04-13', 181332);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dominic Flores', 'Cloud Architect', '2019-06-14', 109150);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kristin Ellis', 'Backend Developer', '2021-06-01', 110817);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Rangel', 'Cloud Architect', '2020-02-04', 69792);
INSERT INTO employees (name, position, start_date, salary) VALUES('Becky Perez', 'Data Scientist', '2022-04-14', 111132);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christine Marshall', 'Cloud Architect', '2019-08-05', 122051);
INSERT INTO employees (name, position, start_date, salary) VALUES('Barbara Williams', 'QA Engineer', '2023-10-20', 119958);
INSERT INTO employees (name, position, start_date, salary) VALUES('Virginia Davenport', 'DevOps Engineer', '2017-06-28', 149300);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brandon Gilbert', 'ML Engineer', '2024-01-05', 79113);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicole Velasquez', 'SysAdmin', '2018-03-19', 179254);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Day', 'Cloud Architect', '2018-05-20', 99029);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kevin Ross', 'ML Engineer', '2016-10-23', 161903);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Patterson', 'Software Engineer', '2020-07-02', 195825);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Johnson', 'Software Engineer', '2023-11-15', 77924);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dillon Larson', 'Frontend Developer', '2022-10-12', 75822);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jason Morgan', 'Frontend Developer', '2016-04-03', 129106);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kimberly Phillips', 'DevOps Engineer', '2017-11-07', 107793);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Silva', 'ML Engineer', '2019-03-13', 163715);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Taylor', 'ML Engineer', '2018-11-06', 81548);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Murphy', 'Backend Developer', '2019-08-07', 93635);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Wilson', 'DevOps Engineer', '2018-04-11', 112751);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Silva', 'Cloud Architect', '2015-03-30', 164422);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rebecca Oconnor', 'SysAdmin', '2018-01-30', 155628);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kristina Jackson', 'Cloud Architect', '2019-09-21', 145031);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stacy Smith', 'QA Engineer', '2019-03-20', 169306);
INSERT INTO employees (name, position, start_date, salary) VALUES('Katherine Stewart', 'Cloud Architect', '2019-09-05', 155167);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Osborne', 'DevOps Engineer', '2015-07-10', 130996);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stacey Bell', 'Backend Developer', '2022-07-01', 86689);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lisa Davis', 'QA Engineer', '2017-07-18', 173390);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christina Brown', 'Frontend Developer', '2022-04-15', 117021);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stacy Perry', 'Software Engineer', '2019-08-08', 82991);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mark Greene', 'QA Engineer', '2022-02-27', 167741);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anthony Russell', 'Cloud Architect', '2023-12-18', 96320);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Allen', 'Backend Developer', '2018-11-03', 145104);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Stone', 'Frontend Developer', '2018-02-16', 189361);
INSERT INTO employees (name, position, start_date, salary) VALUES('Edward Cox', 'DevOps Engineer', '2020-12-28', 120154);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sandra Ray', 'QA Engineer', '2018-10-12', 172744);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Stark', 'Cloud Architect', '2023-10-11', 145301);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ashley Moore', 'ML Engineer', '2021-05-14', 157894);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tom Howard', 'SysAdmin', '2024-01-31', 162030);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jesse Rowland', 'SysAdmin', '2022-06-30', 128042);
INSERT INTO employees (name, position, start_date, salary) VALUES('Samantha Payne', 'DevOps Engineer', '2022-08-13', 68137);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tracy Odom', 'QA Engineer', '2016-04-19', 148607);
INSERT INTO employees (name, position, start_date, salary) VALUES('Erica Douglas', 'DevOps Engineer', '2023-02-26', 104630);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christy Norman DDS', 'Data Scientist', '2023-05-28', 199658);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jonathan Holmes', 'SysAdmin', '2016-05-04', 181582);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Merritt', 'DevOps Engineer', '2022-02-05', 98044);
INSERT INTO employees (name, position, start_date, salary) VALUES('Shawn Santiago', 'SysAdmin', '2022-11-09', 129189);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Rivas', 'Software Engineer', '2023-12-29', 196645);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cynthia Ray DDS', 'QA Engineer', '2015-08-13', 128928);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Pace', 'Software Engineer', '2021-12-02', 153387);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brandon Torres', 'DevOps Engineer', '2018-07-25', 83080);
INSERT INTO employees (name, position, start_date, salary) VALUES('Isabel Carroll', 'Backend Developer', '2016-07-20', 139623);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sarah James', 'Backend Developer', '2022-04-09', 105297);
INSERT INTO employees (name, position, start_date, salary) VALUES('Savannah Wiley', 'SysAdmin', '2023-02-11', 126330);
INSERT INTO employees (name, position, start_date, salary) VALUES('Frank Ray', 'Cloud Architect', '2017-07-25', 106734);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sarah Carroll', 'Data Analyst', '2018-11-22', 135641);
INSERT INTO employees (name, position, start_date, salary) VALUES('Patrick Green', 'ML Engineer', '2015-12-18', 111926);
INSERT INTO employees (name, position, start_date, salary) VALUES('Scott Spencer IV', 'Data Scientist', '2022-01-16', 84018);
INSERT INTO employees (name, position, start_date, salary) VALUES('Charles Lee', 'SysAdmin', '2019-08-30', 107661);
INSERT INTO employees (name, position, start_date, salary) VALUES('Pamela Walker', 'ML Engineer', '2018-04-26', 117600);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karl White', 'Data Analyst', '2018-12-20', 107404);
INSERT INTO employees (name, position, start_date, salary) VALUES('Paige Daugherty', 'Frontend Developer', '2020-10-26', 131151);
INSERT INTO employees (name, position, start_date, salary) VALUES('Phillip Robinson', 'ML Engineer', '2022-05-23', 116234);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laurie Zamora', 'Data Analyst', '2023-08-12', 106637);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lauren Davis', 'Frontend Developer', '2020-09-01', 123070);
INSERT INTO employees (name, position, start_date, salary) VALUES('Olivia Davis', 'Data Analyst', '2015-01-04', 184895);
INSERT INTO employees (name, position, start_date, salary) VALUES('Katie Gonzalez', 'DevOps Engineer', '2018-09-13', 167517);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tina Hill', 'Software Engineer', '2019-02-19', 127202);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amy Jenkins', 'Software Engineer', '2017-10-10', 97663);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Jones', 'Data Analyst', '2022-11-23', 164986);
INSERT INTO employees (name, position, start_date, salary) VALUES('Thomas Petersen', 'Frontend Developer', '2021-05-07', 192883);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dustin Gilbert', 'ML Engineer', '2022-12-06', 131569);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Duncan', 'Data Analyst', '2017-05-05', 173073);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ashley Gonzalez', 'Cloud Architect', '2016-06-12', 143034);
INSERT INTO employees (name, position, start_date, salary) VALUES('Garrett Jackson', 'Software Engineer', '2019-06-10', 99141);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brian Parsons', 'Data Analyst', '2018-01-16', 116202);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danielle Rodriguez', 'DevOps Engineer', '2022-12-07', 164430);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Foster', 'Backend Developer', '2017-01-30', 70644);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mindy Parker', 'Data Analyst', '2019-05-05', 137159);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mallory Alvarez', 'ML Engineer', '2017-05-06', 115036);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Parker', 'QA Engineer', '2021-06-13', 159011);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Mora', 'Data Scientist', '2016-10-22', 138912);
INSERT INTO employees (name, position, start_date, salary) VALUES('Deborah Williams MD', 'Cloud Architect', '2021-06-03', 123991);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [126]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id                   name            position  start_date  salary
0             1      Zachary Rogers MD            SysAdmin  2024-01-31  164268
1             2      Francis Castaneda        Data Analyst  2023-04-09   92677
2             3            Oscar Davis      Data Scientist  2019-02-12  114123
3             4            David Brown   Software Engineer  2021-05-11  183617
4             5         Corey Campbell            SysAdmin  2023-07-04   64790
5             6  Dr. Kyle Martinez DDS         ML Engineer  2017-01-11   86908
6             7        Kristin Russell         ML Engineer  2016-12-07   68990
7             8         Patricia Gates   Backend Developer  2018-04-02  140714
8             9          Kelly Carlson            SysAdmin  2019-12-18  107035
9            10        Samantha Hardin     DevOps Engineer  2016-11-04  198378
10           11           Brian Newman         ML Engineer  2019-09-07   94029
11           12      Mikayla Dickerson         ML Engineer  2020-06-20  171252
12           13          Robert Wilson   Backend Developer  2016-11-27   96765
13           14         Zachary Taylor            SysAdmin  2019-03-19  172969
14           15            Brooke Rice            SysAdmin  2015-06-06  114391
15           16          Ashley Arnold            SysAdmin  2021-02-24   85972
16           17            Amber Gould      Data Scientist  2015-01-22  142882
17           18       Christopher Diaz        Data Analyst  2016-06-05  187503
18           19        Travis Marshall   Software Engineer  2015-11-19  122830
19           20              Beth Hart     Cloud Architect  2017-05-28  156517
20           21        Brian Rodriguez     DevOps Engineer  2020-10-29  108627
21           22          Karen Nichols     Cloud Architect  2020-05-18  126015
22           23            Alan Garcia     DevOps Engineer  2020-09-04  124212
23           24           Ryan Winters        Data Analyst  2018-02-25  147986
24           25          Shelby Taylor      Data Scientist  2016-02-11  180404
25           26        Elizabeth Smith     Cloud Architect  2019-09-21   60200
26           27            Marvin Wood     DevOps Engineer  2016-05-05  184470
27           28            Sharon Hall            SysAdmin  2016-11-13  111090
28           29         Tracie Salazar     DevOps Engineer  2019-06-11  194233
29           30            Chris Smith         ML Engineer  2022-05-28  161000
30           31          Todd Anderson      Data Scientist  2020-10-01  104828
31           32           Brandi Casey   Backend Developer  2015-09-11  148238
32           33           Debra Davies  Frontend Developer  2015-04-19   83147
33           34    Samantha Oliver DDS      Data Scientist  2018-07-22   96135
34           35        Christina Floyd  Frontend Developer  2022-02-17  145760
35           36           Luke Griffin         ML Engineer  2019-11-27   88537
36           37           Sara Stewart        Data Analyst  2023-12-05   72123
37           38           Shirley Hart     Cloud Architect  2015-10-19  111158
38           39          Cynthia Reyes   Backend Developer  2019-11-27  102843
39           40           Adam Johnson        Data Analyst  2021-02-23   69521
40           41      Christina Gardner     DevOps Engineer  2022-03-25  172320
41           42           Anna Pittman  Frontend Developer  2023-12-04  198157
42           43             Juan Brown   Backend Developer  2015-06-21  151509
43           44           Brian Levine     Cloud Architect  2015-06-08  111293
44           45         Allison Miller            SysAdmin  2023-11-11  188380
45           46            Sherry Holt        Data Analyst  2018-09-01  169029
46           47          Larry Douglas        Data Analyst  2021-02-05  136119
47           48           Terry Harris     Cloud Architect  2023-03-11  190637
48           49             Seth Chang   Backend Developer  2018-08-18  107043
49           50           Deborah Ford  Frontend Developer  2020-10-04  130907

`4--`
**Explain each EDA step**

#### **Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.

#### **Data Cleaning**
- I checked for the missing values and I could find that there were no null or empty values present. This was checked using the command `df.info()`
- Also the data types for each columns names were correct as per the requirement using the command `df.info()`

In [127]:
# Column types and null counts
df.info()

# Check for the missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  200 non-null    int64
 1   name         200 non-null    object
 2   position     200 non-null    object
 3   start_date   200 non-null    object
 4   salary       200 non-null    int64
dtypes: int64(2), object(3)
memory usage: 7.9+ KB

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

#### **Data Transformation**
- As part of data transformation , I have created a new column `years_of_service` by calculating the difference between the current date and the sart_date

In [128]:
df['years_of_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df.head()

,employee_id,name,position,start_date,salary,years_of_service
0,1,Zachary Rogers MD,SysAdmin,2024-01-31,164268,1
1,2,Francis Castaneda,Data Analyst,2023-04-09,92677,2
2,3,Oscar Davis,Data Scientist,2019-02-12,114123,6
3,4,David Brown,Software Engineer,2021-05-11,183617,4
4,5,Corey Campbell,SysAdmin,2023-07-04,64790,2

#### **Feature Engineering**
- As a part of the feature engineering, I have added a new column
**Seniority Level** -
  - "Junior" if they have worked less than 3 years
  - "Mid-Level" if they have worked between 3 and 6 years
  - "Senior" if they have worked more than 6 years

  `To implement the Seniority Level, I used the lamda function`.

In [129]:
# Create a seniority level based on years of service
df['seniority'] = df['years_of_service'].apply(
    lambda x: 'Junior' if x < 3 else 'Mid-Level' if x < 7 else 'Senior'
)

# Show new features
df[['employee_id', 'name', 'position', 'years_of_service', 'seniority']].head()

,employee_id,name,position,years_of_service,seniority
0,1,Zachary Rogers MD,SysAdmin,1,Junior
1,2,Francis Castaneda,Data Analyst,2,Junior
2,3,Oscar Davis,Data Scientist,6,Mid-Level
3,4,David Brown,Software Engineer,4,Mid-Level
4,5,Corey Campbell,SysAdmin,2,Junior

#### **Scaling**
- As a part of the feature scaling, I have added a `new column` called **Normalized Salary**. Salary are usually in large numbers like $80,000 or $150,000, which can be hard to compare so I used a method called *Min-Max Scaling* to convert all salaries to a range between **0 and 1** and this makes it easier to make visualizations.

In [130]:
# Normalize the salary column using Min-Max Scaling
minmax = MinMaxScaler()
df['normalized_salary'] = minmax.fit_transform(df[['salary']])

df[['employee_id', 'name', 'position', 'normalized_salary', 'years_of_service', 'seniority']].head()

,employee_id,name,position,normalized_salary,years_of_service,seniority
0,1,Zachary Rogers MD,SysAdmin,0.753144,1,Junior
1,2,Francis Castaneda,Data Analyst,0.235037,2,Junior
2,3,Oscar Davis,Data Scientist,0.390243,6,Mid-Level
3,4,David Brown,Software Engineer,0.893174,4,Mid-Level
4,5,Corey Campbell,SysAdmin,0.033218,2,Junior

`5--`
- Show Descriptive Statistics

I have used the following commands here. They are:
- `.info()` -  shows the column data types and the count of non-null values.
- `.describe()` gives summary statistics like mean, min, max, standard deviation, count and quartiles.
- `.isnull().sum()` shows if any values are missing

In [ ]:
# shows the column data types and the frequency of non-null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employee_id        200 non-null    int64
 1   name               200 non-null    object
 2   position           200 non-null    object
 3   start_date         200 non-null    object
 4   salary             200 non-null    int64
 5   years_of_service   200 non-null    int32
 6   seniority          200 non-null    object
 7   normalized_salary  200 non-null    float64
dtypes: float64(1), int32(1), int64(2), object(4)
memory usage: 11.8+ KB

In [ ]:
# shows the count of missing values
df.isnull().sum()

employee_id          0
name                 0
position             0
start_date           0
salary               0
years_of_service     0
seniority            0
normalized_salary    0
dtype: int64

In [ ]:
# Shows the summary statistics like count, mean, standard deviation, min, max and the quartiles.
df.describe()

       employee_id         salary  years_of_service  normalized_salary
count   200.000000     200.000000        200.000000         200.000000
mean    100.500000  130727.920000          5.800000           0.510414
std      57.879185   40243.695428          2.656177           0.291245
min       1.000000   60200.000000          1.000000           0.000000
25%      50.750000   97037.250000          4.000000           0.266593
50%     100.500000  129118.000000          6.000000           0.498762
75%     150.250000  164201.250000          8.000000           0.752661
max     200.000000  198378.000000         10.000000           1.000000